class BotReply:
    FEEDBACK_REPLY = "小助理收到你的反馈\n我已经通知技术值班人员「%s」, 请耐心等待"
    FEEDBACK_RECOMMEND_REPLY = "小助理收到你的反馈\n我已经通知产品值班人员「%s」, 请耐心等待"
    FEEDBACK_FIX_REPLY = "小助理已经更新id=「%s」反馈的处理状态"
    FEEDBACK_FIX_ERROR_REPLY = "小助理没有发现id=「%s」的反馈哦，请重新输入"
    NO_MATCH_REPLY = "小助理无法识别你的指令，请填写指令需要的参数"
    SUCCESS_REPLY = "小助理已经执行你的指令"
    NO_DELETE_DUTY_REPLY = "不能删除当前的值班人员哦"
    NO_AUTHORITY = "小助理无法执行你的指令，需要有权限的人才能使用哦"
    SIGN_IN_REPLY = "「%s」已成功签入"
    SIGN_OUT_REPLY = "「%s」已成功签出"
    ALREADY_SIGNED_IN = "「%s」今天已经签到过了"
    DID_NOT_SIGNED_IN = "「%s」今天还未签到过，请先签到"


class BotNotify:
    FEEDBACK_NOTIFY_MD = "小助理收集到来自子频道「%s」用户的反馈:\n" \
                         + "\n" + "> 反馈ID: %s" \
                         + "\n" + "> 反馈用户: %s" \
                         + "\n" + "> 反馈内容: %s" \
                         + "\n\n" + "请技术值班人员「%s」处理"
    FEEDBACK_RECOMMEND_NOTIFY_MD = "小助理收集到来自子频道「%s」用户的建议:\n" \
                                   + "\n" + "> 反馈ID: %s" \
                                   + "\n" + "> 反馈用户: %s" \
                                   + "\n" + "> 反馈内容: %s" \
                                   + "\n\n" + "请产品值班人员「%s」处理"
    NOTIFY_SIGN_IN = "「%s」你今天还未签到，请及时签到"
    NOTIFY_SIGN_OUT = "「%s」你今天还未签出，请及时签出以及发出值班日报哦"
    EVENING_NOTIFY_MD = "**你的夜晚太珍贵，我们不忍心占用** \n\n为避免影响大家休息，每晚12点开启全员禁言，次日早上8点解封"


class BotDefault:
    DEFAULT_GET_FEEDBACK = "当前还没有用户反馈哦"
    DEFAULT_DUTY = "「今日值班」"
    DEFAULT_NOT_TIME = "「未排班」"
    DEFAULT_HELP_MD = "**常用指令**"+"\n" \
                   + "\n" + "> **/问题反馈** [问题内容]" \
                   + "\n" + "> 反馈一些问题，并通知值班人员" \
                   + "\n" + "\u200B**/产品建议** [建议内容]" \
                   + "\n" + "> 提供一些需求建议，并通知值班人员" \
                   + "\n" + "> **/查看值班表**" \
                   + "\n" + "> 查看当前的官方值班表和今日值班人员" \
                   + "\n\n" + "\u200B**值班人员指令**" + "\n" \
                   + "\n" + "> **/当日反馈**" \
                   + "\n" + "> 查看当天的用户反馈" \
                   + "\n" + "> **/值班签到**" \
                   + "\n" + "> 当天值班人员签到" \
                   + "\n" + "> **/值班签出**" \
                   + "\n" + "> 当天值班人员签出" \
                   + "\n" + "> **/标注解决** [反馈ID]" \
                   + "\n" + "> 标注问题的解决状态" \
                   + "\n\n" + "\u200B**管理员指令**" + "\n" \
                   + "\n" + "> **/值班人员增加** @人员A @人员B" \
                   + "\n" + "> 增加值班人员A、B(支持多参数)" \
                   + "\n" + "> **/值班人员移除** @人员A @人员B" \
                   + "\n" + "> 移除值班人员A、B(支持多参数)" \
                   + "\n" + "> **/值班交换** @人员A @人员B" \
                   + "\n" + "> 交换两个值班人员的值班时间" \
                   + "\n" + "> **/重新排班** @人员A" \
                   + "\n" + "> 从某个值班人员开始从今天重新排班"
